---
kind: enumMember
id: F:Autodesk.Revit.DB.BRepBuilderState.Completed
enum: Autodesk.Revit.DB.BRepBuilderState
source: html/fc45f13e-33ba-47ca-3faf-558517899a90.htm
---
# Autodesk.Revit.DB.BRepBuilderState.Completed

Finish() successfully created a valid Geometry object. No new data may be added.The built object may be retrieved via GetResult().